import time
import os


been_in_1 = 0
been_in_2 = 0
been_in_3 = 0
been_in_4 = 0
been_in_5 = 0
been_in_6 = 0


help_tung = 0
help_tralalero = 0
help_67 = 0
help_amungus = 0
points = help_67 + help_amungus + help_tung + help_tralalero




def room_1(name):
        global been_in_1
        if been_in_1 == 0:
          time.sleep(2)
          print("""
             .           .
            /|__________/|
          .// /       .//|    
          |/_/________|//|  
          |_|_________|/    
          |           |      


                """)
          time.sleep(2)
          print(f"Hej {name} välkomen till spelet du är just nu hemma och har precis vaknat (Rum 1)")
          time.sleep(2)
          print("Sedan kom du på att du skulle hjälpa dina kompisar")
          time.sleep(2)
          print("Ditt mål nu är att utforska ditt hus och hjälpa alla kompisar på vägen")
          been_in_1 = 1
          time.sleep(4)
        print("""
             __________
            |  __  __  |
            | |  ||  | |
            | |  ||  | |
            | |__||__| |
            |  __  __()|
 _______    | |  ||  | |
|_o_|_o_|   | |  ||  | |
|___o___|   | |  ||  | |   ^~^  ,
|___o___|   | |  ||  | |  ('Y') )
|___o___|   | |__||__| |  /   \/
 ||   ||    |__________| (\|||/)
          """)
        time.sleep(2)
        print("Du ser en dörr och din garderob framför dig")
        time.sleep(2)
        open_were = input("Vad vill du göra öppna dörren eller öppna garderoben?\n").lower()
        if open_were == "dörren" or open_were =="öppna dörren":
            print("Du öppnar dörren och går in till hallen")
            time.sleep(2)
            os.system("cls")
            room_2(name)
        elif open_were == "garderoben" or open_were =="öppna garderoben":
            print("Du går till garderoben och öppnar den")
            time.sleep(3)
            print("du hittar inte jätte många saker i den förutom dina kläder och en gamal fotboll")
            time.sleep(3)
            print("""
    ,==c==.
    |_/|\_|
    |  |  |     _._
    |  |  |   .'--.`.
    |  |  |   |  .' |
    |__|__|    `--`'
                  """)
            time.sleep(2)
            print("du väljer nu att öppna dörren och går ut till hallen")
            time.sleep(4)
            os.system("cls")
            room_2(name)
       
       
       
       
def room_2(name):
    global been_in_2
    if been_in_2 == 0:
        been_in_2 = 1
        print(f"Hej {name} du är nu i hallen för första gången  (Rum 2)")
        time.sleep(1)
    else:
        print(f"Hej {name} du är tillbaka i hallen (Rum 2)")
        time.sleep(1)
    time.sleep(2)
    print("""    


 __________         __________         __________         __________
|  __  __  |       |  __  __  |       |  __  __  |       |  __  __  |
| |  ||  | |       | |  ||  | |       | |  ||  | |       | |  ||  | |
| |  ||  | |       | |  ||  | |       | |  ||  | |       | |  ||  | |
| |__||__| |       | |__||__| |       | |__||__| |       | |__||__| |
|  __  __()|       |  __  __()|       |  __  __()|       |  __  __()|
| |  ||  | |       | |  ||  | |       | |  ||  | |       | |  ||  | |
| |  ||  | |       | |  ||  | |       | |  ||  | |       | |  ||  | |
| |  ||  | |       | |  ||  | |       | |  ||  | |       | |  ||  | |
| |  ||  | |       | |  ||  | |       | |  ||  | |       | |  ||  | |
| |__||__| |       | |__||__| |       | |__||__| |       | |__||__| |
|__________|       |__________|       |__________|       |__________|  
  (Dörr 1)           (Dörr 2)           (Dörr 3)          (Dörr 4)
""")
    time.sleep(2)
    print("Dörr 1 går tillbaka till ditt rum")
    time.sleep(1)
    print("Dörr 2 går till köket")
    time.sleep(1)
    print("Dörr 3 går till vardagsrummet")
    time.sleep(1)
    print("Dörr 4 går går du ut från huset")
    time.sleep(2)
    open_door = input("Vilken dörr vill du gå in i? 1,2,3,4?\n").lower()
    if open_door == "dörr 1" or open_door == "1":
        print("Du går in i dörr 1")
        time.sleep(3)
        os.system("cls")
        room_1(name)
    elif open_door == "dörr 2" or open_door == "2":
        print("Du går in i dörr 2")
        time.sleep(3)
        os.system("cls")
        room_3(name)
    elif open_door == "dörr 3" or open_door == "3":
        print("Du går in i dörr 3")
        time.sleep(3)
        os.system("cls")
        room_4(name)
    elif open_door == "dörr 4" or open_door == "4":
        print("Du går in i dörr 4")
        endroom(name)
        time.sleep(3)
        os.system("cls")
    return()




def room_3(name):
    global been_in_3
    global help_tung
    if been_in_3 == 0:
      been_in_3 = 1
      print(f"Hej {name} du är nu i köket  (Rum 3)")
      time.sleep(2)
      print("när du kommer in i köket ser du din kompis tung tung sahur")
      time.sleep(2)
      print("""
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠐⢂⠐⡒⠂⣐⡢⠤⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡜⢁⣺⣿⣿⣿⣿⣿⣿⣿⣶⠈⡁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠞⠃⠼⢽⣿⣿⠿⠻⠛⠻⢿⣿⠀⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣵⠁⠀⠀⠀⠙⠁⠀⠀⢠⡀⠀⢬⠃⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡟⠀⠀⠻⡄⠀⣇⠀⠃⠀⠘⡇⠀⠄⢿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡞⠀⠀⠀⢈⢸⡿⣦⣀⢀⣀⣴⣷⡆⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠙⠳⠞⠁⠸⠷⠦⠈⠉⠉⠉⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢫⣦⠀⠀⠆⠀⠀⠤⠿⠂⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣧⡄⠀⠀⠀⠈⣠⡼⠃⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠃⠀⠀⠀⠛⠉⠀⢀⠠⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢾⠠⠀⠀⠀⠀⢤⠘⠤⠁⢰⡆⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⢠⠋⠤⡉⠐⡀⠀⢿⠸⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠄⠀⠀⡘⢀⠆⠡⠀⠀⣈⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡐⠈⠤⢁⠂⠀⡟⢰⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⡀⠀⠀⠀⠠⠁⠂⠄⠀⣸⠁⣸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠁⠀⠀⠀⠀⠀⠀⠀⠈⠁⢰⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡤⢁⠆⠀⠀⠀⢀⣐⠀⠀⠀⢀⣸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⠐⡁⠁⣼⡇⠀⠀⣿⣿⠀⡀⢀⣷⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⠁⡔⠀⣼⣿⡇⣀⠀⣿⣿⡆⣡⠘⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡰⢠⡞⢀⣾⣿⣿⣇⠀⠀⢿⣿⡇⠁⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⣴⡇⢠⣾⠋⠠⢸⣿⠀⠀⢸⣿⣧⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠌⣼⠍⢀⣿⡇⢐⠘⢸⣿⡀⠀⢸⣿⣿⡀⠀⣻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⠊⡸⠁⢀⣾⠟⣀⢂⠀⢰⣿⣇⢀⠈⣿⣿⡇⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠜⠁⠄⠀⢠⡾⠫⢀⠸⠠⣴⣿⣿⡟⠀⠀⢿⡿⠁⠀⠘⡾⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡴⠋⠀⠀⠀⣠⣾⢁⡆⢚⠼⠛⣛⣹⡏⠀⠀⠀⠀⢠⣾⣆⠀⢻⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠢⢀⡀⠀⢰⡏⣴⢯⡂⠄⠤⡶⠋⠉⣁⣠⣴⡆⠰⠛⠻⠻⠢⠘⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠑⠋⠘⢑⠻⣿⣷⣶⣶⣾⡿⢟⢩⣯⣁⣀⡊⣘⣀⣀⣤⣿⠀
  """)
      help = input("Skulle du kunna hjälpa mig med en sak? J/N\n").upper()
      time.sleep(2)
      if help == "J":
          print("jag har tappat bort min katt kan du hjälpa mig att hitta den?")
          time.sleep(2)
          print("""
  Den ser ut så här:
    ^~^  ,
   ('Y') )
   /   \/
  (\|||/)
  """)
          print("senaste gånger jag såg han försökte han leka med en gamal fotboll")
          time.sleep(2)
          while True:
            svar = input("Vilket rum är katten i ?\n")
            if svar == "1":
              print(f"tack så myckte {name} han betyder väldigt mycket för mig")
              time.sleep(2)
              print(f"DU har nu hjälp Tung tung sahur")
              help_tung = 1
              break
            elif not svar =="1":
              print("Katten var inte i det rummet försök igen tack")
      elif help == "N":
        help_tung = 0
        print("Du hjälpte inte din kompis och fick inte något poäng han blev lite ledsen")
        time.sleep(2)
      print("nu efter du har pratat med personen ser du 2 dörrar")
      time.sleep(2)
   
    print("""
    __________     __________
   |  __  __  |   |  __  __  |
   | |  ||  | |   | |  ||  | |
   | |  ||  | |   | |  ||  | |
   | |__||__| |   | |__||__| |
   |  __  __()|   |  __  __()|
   | |  ||  | |   | |  ||  | |
   | |  ||  | |   | |  ||  | |
   | |  ||  | |   | |  ||  | |
   | |  ||  | |   | |  ||  | |
   | |__||__| |   | |__||__| |
   |__________|   |__________|
     (Dörr 1)       (Dörr 2)
           """)
    print("Dörr 1 Går tillbaka till Hallen")
    time.sleep(2)
    print("Dörr 2 Går till nästa rum")
    door = input("vilken dörr vill du gå in i\n")
    time.sleep(2)
    if door == "1":
      time.sleep(4)
      os.system("cls")
      room_2(name)
    elif door == "2":
      time.sleep(4)
      os.system("cls")
      room_5(name)
      return()


def room_4(name):
    global help_tralalero
    global been_in_4
    if been_in_4 == 0:
      been_in_4 = 1
      print(f"Hej {name} du är nu i vardagsrummet (Rum 4)")
      time.sleep(2)
      print("när du kommer in i vardagsrummet ser du din kompis tralalero tralala")
      time.sleep(2)
      print("""
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⡟
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⢟⣝⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⡟⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣴⣭⣝⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⡿⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣤⣴⡞⣛⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⣴⣮⣽⣯⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣾⢷⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⠃⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠴⣖⣋⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣟⣻⡷⢦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⡿⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⣀⣠⣶⣿⣷⢾⣿⣿⣿⣿⣿⣛⣿⢿⣿⣿⣿⣿⣿⣿⣽⣿⣿⠛⣿⣿⣿⣿⣿⣿⣷⡄⠉⢳⣦⣀⠀⠀⠀⠀⢀⡄⠀⠀⠀⢀⣾⣟⣿⠁⠀⠀⠀⠀
  ⠀⠀⢀⣠⣴⣾⣿⢿⣭⣉⣿⣿⣿⣿⣿⡿⠿⠿⠿⠿⢿⣿⠿⣿⢿⢻⣿⣿⣿⣷⣿⣿⡀⣯⢙⡻⣿⣿⣦⡈⣙⣿⣶⣤⣀⣤⣾⡁⠀⢀⣀⣾⣿⣿⡏⠀⠀⠀⠀⠀
  ⠰⠿⣿⡿⠿⣟⠻⣶⠉⠿⠟⠉⢉⣉⣤⠤⠶⠶⢤⠀⡀⠙⢀⡈⠎⠊⠃⢻⣿⣿⣿⣿⣿⣿⣾⣿⣿⣿⣿⣧⣼⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠃⢻⠀⠀⠀⠀⠀⠀
  ⠀⠀⠈⠻⠛⠛⠿⠥⠤⠶⠖⠊⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠈⠀⠀⢿⠛⠿⣿⣿⣿⢿⡇⠀⠈⠉⠉⠻⠿⣷⣿⣿⣉⠻⡿⢛⣹⠟⠛⠳⣤⣿⣄⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠓⠒⠲⠶⠶⠤⠤⠤⣤⠀⠀⠀⠀⠀⠀⠀⠈⠛⠷⣶⡾⣿⣿⣾⣻⣦⡀⠤⢄⣰⣂⣈⣿⣿⣿⣦⡙⠻⢧⠀⠀⠀⠉⡻⢿⠤⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠂⠰⢦⣤⠽⠦⢤⣄⣀⣀⣀⣀⣲⣿⣿⣷⣹⣧⡙⠿⠿⣿⣿⠋⠛⠺⣿⡿⢷⣾⣇⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠀⠀⡼⠃⠀⠀⠀⠀⠈⠉⠉⠉⠉⠉⢹⣿⣿⣿⣧⡀⠀⠈⠛⠀⠀⠀⣽⣿⣿⣏⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣤⣾⠇⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣧⠀⠀⠀⠀⠀⠺⢻⣿⣿⣧⣽⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⡿⣿⣾⣰⢿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣟⣿⠂⠀⠀⠀⠾⢿⣿⣿⡿⠿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⡀⢈⣿⡿⣫⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣾⣿⣿⣧⣤⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⠟⢹⡇⠻⣫⣽⡿⢟⣛⣻⡀⠀⠀⠀⠀⠀⠀⣼⣿⠛⠻⢿⣿⣿⣿⡿⢷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⣤⡾⠛⠁⣠⣼⢿⣿⣵⡤⠴⠚⠋⠉⠀⠀⠀⠀⠀⢀⡴⠯⣌⠻⠿⢮⡭⣸⣿⣧⢾⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠘⠿⢿⣿⣿⣿⡿⠭⠚⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⠛⠀⣀⠀⢀⣼⣿⣿⣿⠟⣡⣿⣿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⡟⠀⠀⠀⠀⠀⣼⠃⠛⠛⣡⣾⠟⢛⡁⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⠞⣹⡇⢀⠉⠀⠀⠀⢸⣷⣴⠞⠉⢀⣠⡿⠟⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣄⣾⡿⠷⠟⠋⠀⠀⢀⣀⣠⣶⠾⣋⣡⡶⠞⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣶⣶⣶⣶⣶⣛⣋⣉⣩⠶⠟⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠉⠉⠉⠉⠁⠀⠀⠀
      """)
      help_tralalero = 0
      while True:
          time.sleep(2)
          help = input("Skulle du kunna hjälpa mig med en sak? J/N\n").upper()
          time.sleep(2)
          if help == "J":
              print("det är en gåta jag tänker på. Vilken pokemon är det som är gul med röda kinder som Ash har?")
              time.sleep(2)
              while True:
                  print("Jag tror att det kan vara pikachu, Charizard eller bulbasaur")
                  time.sleep(2)
                  pokemon = input().lower()
                  if pokemon == "pikachu":
                      print(f"Tack så mycket {name} det var rätt")
                      time.sleep(2)
                      print(f"DU har nu hjälp tralalero tralala")
                      help_tralalero = 1
                      time.sleep(2)
                      break
                  elif not pokemon == "pikachu":
                      print("Det var inte rätt försök igen")
                      time.sleep(2)
              break
              print("oh ok")
              help_tralalero = 0
              break
          else:
              print("Du skrev fel skriv J/N tack")
              time.sleep(2)
      print("nu efter du har pratat med personen ser du 2 dörrar")
      time.sleep(2)
   
    print("""
   __________     __________
  |  __  __  |   |  __  __  |
  | |  ||  | |   | |  ||  | |
  | |  ||  | |   | |  ||  | |
  | |__||__| |   | |__||__| |
  |  __  __()|   |  __  __()|
  | |  ||  | |   | |  ||  | |
  | |  ||  | |   | |  ||  | |
  | |  ||  | |   | |  ||  | |
  | |  ||  | |   | |  ||  | |
  | |__||__| |   | |__||__| |
  |__________|   |__________|
    (Dörr 1)       (Dörr 2)
          """)
    print("Dörr 1 Går tillbaka till Hallen")
    time.sleep(2)
    print("Dörr 2 Går till nästa rum")
    door = input("vilken dörr vill du gå in i\n")
    if door == "1":
      time.sleep(4)
      os.system("cls")
      room_2(name)
    elif door == "2":
      time.sleep(4)
      os.system("cls")
      room_6(name)
      return()


def room_5(name):
  global help_67
  global been_in_5
  help_67 = 0
  if been_in_5 == 0:
    been_in_5 = 1
    print("Du har nu gått in i tvättstugan (Rum 5)")
    print("Ser du din kompis 67")
    time.sleep(3)
    print("""




  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣴⣶⣶⣶⣶⣤⣀⠀⠀⠀⠀⠠⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⡿⠿⠿⣿⣿⣿⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⠏⠁⠀⠀⠀⠀⠈⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⡟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⠃⣀⣄⣴⣶⣶⣤⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣿⠛⠁⠀⠀⠀⠀⠻⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣆⠀⠀⠀⠀⠀⢀⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣿⣷⣤⣤⣤⣴⣿⣿⣿⠟⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⡟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⢿⣿⣿⣿⣿⣿⣿⠟⠋⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
          """)
    time.sleep(3)
    help = input("Han undrar ifall du kan hjälpa han med en matte fråga J/N\n").upper()
    time.sleep(2)
    if help == "J":
        print("vad är 30+25+12?")
        time.sleep(2)
        while True:
            math = input().lower()
            if math == "67":
                print(f"Tack så mycket {name} det var rätt")
                time.sleep(2)
                print(f"DU har nu hjälp 67")
                help_67 = 1
                time.sleep(2)
                break
            elif not math == "67":
                print("Det var inte rätt försök igen")
                time.sleep(2)
    print("""
   __________    
  |  __  __  |  
  | |  ||  | |
  | |  ||  | |  
  | |__||__| |
  |  __  __()|  
  | |  ||  | |  
  | |  ||  | |  
  | |  ||  | |
  | |  ||  | |
  | |__||__| |  
  |__________|  
    (Dörr 1)    
          """)
    print("Dörr 1 Går tillbaka till Rum nr 3")
    time.sleep(2)
    door = input("Vill du gå tillbaka till rum nr 3 J/N\n").upper()
    if door == "J":
      time.sleep(4)
      os.system("cls")
      room_3(name)
    elif door == "N":
      time.sleep(4)
      os.system("cls")
      print("Du valde att inte gå tillbaka och står kvar i rummet")




def room_6(name):
  global help_amungus
  global been_in_6
  help_amungus = 0
  if been_in_6 == 0:
    been_in_6 = 1
    print("Du har nu gått in i badrummet (Rum 6)")
    print("Ser du din kompis Amungus ")
    time.sleep(2)
    print("""
         
         
⠀   ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣤⣤⣤⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀
⠀   ⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⡿⠛⠉⠙⠛⠛⠛⠛⠻⢿⣿⣷⣤⡀⠀⠀⠀⠀⠀
⠀   ⠀⠀⠀⠀⠀⠀⠀⣼⣿⠋⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⠈⢻⣿⣿⡄⠀⠀⠀⠀
⠀   ⠀⠀⠀⠀⠀⠀⣸⣿⡏⠀⠀⠀⣠⣶⣾⣿⣿⣿⠿⠿⠿⢿⣿⣿⣿⣄⠀⠀⠀
⠀   ⠀⠀⠀⠀⠀⠀⣿⣿⠁⠀⠀⢰⣿⣿⣯⠁⠀⠀⠀⠀⠀⠀⠀⠈⠙⢿⣷⡄⠀
⠀   ⠀⣀⣤⣴⣶⣶⣿⡟⠀⠀⠀⢸⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣷⠀
⠀   ⢰⣿⡟⠋⠉⣹⣿⡇⠀⠀⠀⠘⣿⣿⣿⣿⣷⣦⣤⣤⣤⣶⣶⣶⣶⣿⣿⣿⠀
⠀   ⢸⣿⡇⠀⠀⣿⣿⡇⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠃⠀
⠀   ⣸⣿⡇⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠉⠻⠿⣿⣿⣿⣿⡿⠿⠿⠛⢻⣿⡇⠀⠀
⠀   ⣿⣿⠁⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣧⠀⠀
⠀   ⣿⣿⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀
⠀   ⣿⣿⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀
⠀   ⢿⣿⡆⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⡇⠀⠀
⠀   ⠸⣿⣧⡀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠃⠀⠀
⠀   ⠀⠛⢿⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀⣰⣿⣿⣷⣶⣶⣶⣶⠶⠀⢠⣿⣿⠀⠀⠀
⠀   ⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⣿⣿⡇⠀⣽⣿⡏⠁⠀⠀⢸⣿⡇⠀⠀⠀
⠀   ⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⣿⣿⡇⠀⢹⣿⡆⠀⠀⠀⣸⣿⠇⠀⠀⠀
⠀   ⠀⠀⠀⠀⠀⠀⢿⣿⣦⣄⣀⣠⣴⣿⣿⠁⠀⠈⠻⣿⣿⣿⣿⡿⠏⠀⠀⠀⠀
⠀   ⠀⠀⠀⠀⠀⠀⠈⠛⠻⠿⠿⠿⠿⠋⠁⠀⠀
          """)
    time.sleep(3)
    help = input("han undrar ifall du kan hjälpa han med en fråga J/N\n").upper()
    time.sleep(2)
    if help == "J":
        print("Jag har hört massa personer som säger att Ronaldo är den bästa fotbollsspelaren i världen, men är inte Messi Bättre än honom? (Svara med Ronaldo eller Messi)\n")
        time.sleep(2)
        while True:
            time.sleep(2)
            football = input().lower()
            if football == "ronaldo":
                print(f"Tack så mycket {name} det var rätt")
                time.sleep(2)
                print(f"DU har nu hjälp Amungus")
                help_amungus = 1
                time.sleep(2)
                break
            elif not football == "ronaldo":
                print("Det var inte rätt försök igen")
                time.sleep(2)
    elif help =="N":
        print("oh ok")
       
    print("""
   __________    
  |  __  __  |  
  | |  ||  | |
  | |  ||  | |  
  | |__||__| |
  |  __  __()|  
  | |  ||  | |  
  | |  ||  | |  
  | |  ||  | |
  | |  ||  | |
  | |__||__| |  
  |__________|  
    (Dörr 1)    
          """)
    print("Dörr 1 Går tillbaka till Rum nr 4")
    time.sleep(2)
    while True:
      door = input("Vill du gå tillbaka till Rum nr 4 J/N\n").upper()
      if door == "J":
        time.sleep(4)
        os.system("cls")
        room_4(name)
      elif door == "N":
        time.sleep(4)
        os.system("cls")
        print("Du valde att inte gå tillbaka och står kvar i rummet")
      else:
        print("Skriv J eller N tack")
       
       
def endroom(name):
    points = help_67 + help_amungus + help_tung + help_tralalero
    time.sleep(2)
    print("Du har nu kommit till slutrummet")
    time.sleep(2)
    print("""__________     __________
            |  __  __  |   |  __  __  |
            | |  ||  | |   | |  ||  | |
            | |  ||  | |   | |  ||  | |
            | |__||__| |   | |__||__| |
            |  __  __()|   |  __  __()|
            | |  ||  | |   | |  ||  | |
            | |  ||  | |   | |  ||  | |
            | |  ||  | |   | |  ||  | |
            | |  ||  | |   | |  ||  | |
            | |__||__| |   | |__||__| |
            |__________|   |__________|
         
              (Dörr 1)       (Dörr 2)
""")
 
    if points == 0:
        print("Du har hjälp 0/4 brainrots, Du kommer att förlora ifall du avslutar")
    elif points == 1:
        print("Du har hjälp 1/4 brainrots, Du kan avsluta ifall du vill")
    elif points == 2:
        print("Du har hjälp 2/4 brainrots, Du kan avsluta ifall du vill")
    elif points == 3:
        print("Du har hjälp 3/4 brainrots, Du kan avsluta ifall du vill")
    elif points == 4:
       print("Du har hjälp 4/4 brainrots, Du kan avsluta ifall du vill")


    time.sleep(2)
    print("Dörr 1 avslutar spelet")
    time.sleep(4)
    print("Dörr 2 tar dig tillbaka")
    while True:
        val = input("Vilken dörr vill du gå in i  (1/2)")
        if val == "1":
            print("Du har avslutat spelet")
            print(f"Dina poäng: {points}/4")
            break
            exit()
        elif val == "2":
            print("du går tillbaka")
            time.sleep(2)
            os.system("cls")
            room_2(name)
            break
        else:
            print("Du har valt något, testa igen")



